create table tb_studeny(
Sno char(11) primary key,
Sname char(20),
Ssex char(2) check(Ssex = '男' or Ssex = '女') default '男' not null,
Sage smallint,
Sdept char(20) 
)
sp_help tb_studeny
select Sno,SName,Ssex,Sage,Sdept from tb_studeny
insert into tb_studeny(Sno,Sname,Ssex,Sage,Sdept)
Values(200215121,'李勇','男',20,'cs'),
(200215122,'刘晨','女',19,'cs'),
(200215123,'王敏','女',18,'ma'),
(200215124,'张立','男',19,'is'),
(200215125,'王猛','男',19,'cs'),
(200215126,'小红','女',19,'ma'),
(200215127,'小花','女',19,'is'), 
(200215128,'小刘','女',19,'cs'),
(200215129,'小何','女',19,'cs'), 
(2002151210,'小王','女',19,'cs'), 
(2002151211,'小李','女',19,'cs'), 
(2002151212,'小寒','女',19,'cs'),
(2002151213,'小萌','女',19,'cs'),
(2002151214,'小张','女',19,'cs'),
(2002151215,'小勇','女',19,'cs'),
(2002151216,'小李','女',19,'cs'),
(2002151217,'小美','女',19,'cs'), 
(2002151218,'小敏','女',19,'cs'),
(2002151219,'小玉','女',19,'cs'), 
(2002151220,'小雨','女',19,'cs'), 
(2002151221,'小达','女',19,'cs'), 
(2002151222,'小郭','女',19,'cs'), 
(2002151223,'小璧','女',19,'cs'), 
(2002151224,'小古','女',19,'cs'), 
(2002151225,'小丽','女',19,'cs'), 
(2002151226,'小吴','女',19,'cs')
