 --create database db_create
 use db_create
 create table tb_student(
sno char(11) primary key ,         
sname char(20)not null,
Ssex char(2)check(Ssex ='man' or Ssex ='woman'),
Sage smallint 
)
 sp_help tb_student
 select Sno,SName,Ssex,Sage from tb_student
 insert into tb_student(Sno,Sname,Ssex,Sage )
 Values(200215121,'李勇','男',20,'cs'),
 (200212125,'刘晨','女',18,'cs'),
 (200210131,'王二','男',17,'cs'),
 (200215130,'张三','男',28,'cs'),
 (200215112,'李四','男',30,'cs'),
 (200215112,'麻子','男',42,'cs'),
 (200215130,'康康','男',35,'cs'),
 (200215129,'小红','女',31,'cs'),
 (200215118,'小刚','男',20,'cs'),
 (200215118,'李红','女',21,'cs'),
 (200215125,'程咬金','男',23,'cs'),
 (200215115,'白雪','女',25,'cs'),
 (200215122,'白灵','女',26,'cs'),
 (200215129,'王世充','男',56,'cs'),
 (200215123,'李世民','男',48,'cs'),
 (200215124,'狐狸','女',35,'cs'),
 (200215128,'徐卫国','男',48,'cs'),
 (200215115,'刘红','女',19,'cs'),
 (200215116,'白鸽','女',19,'cs'),
 (200215117,'刘亮','男',16,'cs'),
 (200215118,'小沈龙','男',19,'cs'),
 (200215125,'杨枔','女',58,'cs'),
 (200215127,'姜尚','男',54,'cs'),
 (200215126,'妲己','女',41,'cs'),
 (200215125,'申公豹','男',28,'cs'),
 (200215131,'纣王','男',25,'cs'),
 